<?php

use Illuminate\Database\Seeder;

class CategoriesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            "Личен разход Александър" => [1, 0],
            "Личен разход Валентин"   => [0, 1],
            "Теглене Александър"      => [1, 0],
            "Теглене Валентин"        => [0, 1],
            "Командировка Александър" => [1, 0],
            "Командировка Валентин"   => [0, 1],
            "Заплати"                 => [0.5, 0.5],
            "Осигуровки"              => [0.5, 0.5],
            "Такси"                   => [0.5, 0.5],
            "Данъци"                  => [0.5, 0.5],
            "Ресторант"               => [0.5, 0.5],
            "Офис разход"             => [0.5, 0.5],
            "Adobe"                   => [0.5, 0.5],
            "AWS"                     => [0.5, 0.5],
            "Invision"                => [0.5, 0.5],
            "BrowserStack"            => [0.5, 0.5],
            "Jira"                    => [0.5, 0.5],
            "CoolBox"                 => [0.5, 0.5],
            "DigitalOcean"            => [0.5, 0.5],
            "Google"                  => [0.5, 0.5],
            "PoEditor"                => [0.5, 0.5],
            "SuperHosting"            => [0.5, 0.5],
            "Telenor"                 => [1, 0],
            "Vivacom"                 => [0.5, 0.5],
            "DepositPhotos"           => [0.5, 0.5],
            "Sentry"                  => [0.5, 0.5],
            "Друго"                   => [0.5, 0.5],
            "Приход"                  => [0.5, 0.5],
            "Граждански договори"     => [0.5, 0.5],
            "Счетоводни разходи"      => [0.5, 0.5],
            "Наем"                    => [0.5, 0.5],
            "Почистване офис"         => [0.5, 0.5],
            "EVN"                     => [0.5, 0.5],
        ];

        foreach ($data as $name => $parts) {
            $category = \App\Category::updateOrCreate([
                'name' => $name,
            ], [
                'user_1' => $parts[0],
                'user_2' => $parts[1],
            ]);
        }
    }
}
