<?php
return [
    "invoice_number"      => "Фактура Номер",
    "date_created"        => "Дата на издаване",
    "total_amount"        => "Обща стойност",
    "invoice"             => "ФАКТУРА",
    "original"            => "ОРИГИНАЛ",
    "copy"                => "КОПИЕ",
    "proform"             => "ПРОФОРМА",
    "provider"            => "Доставчик",
    "recipient"           => "Получател",
    "eik"                 => "ЕИК",
    "egn"                 => "ЕГН",
    "description"         => "Наименование на стоката / услугата",
    "unit"                => "Количество",
    "unit_price"          => "Ед. цена",
    "amount"              => "Стойност",
    "notes"               => "Бележки",
    "vat_reason_eu_adv"   => "Основание за неначисляване на ДДС - чл. 21, ал.2 от ЗДДС",
    "vat_reason_eu_vat"   => "Основание за неначисляване на ДДС - чл. 21, ал.2 от ЗДДС",
    "vat_reason_eu_novat" => "Основание за начисляване на ДДС - чл. 21, ал.1 от ЗДДС",
    "vat_reason_outes"    => "Основание за неначисляване на ДДС - чл. 21, ал.5, т.2 в) от ЗДДС",
    "date_event"          => "Дата на данъчно събитие",
    "date_adv_payment"    => "Дата на авансово плащане",
    "payment"             => "Начин на плащане: Банков път",
    "bank"                => "ProCredit Bank",
    "subtotal"            => "Данъчна основа",
    "vat_rate"            => "Данъчна ставка",
    "vat_amount"          => "Размер на данъка",
    "currency"            => "Валута",
    "rate"                => "Курс",
    "total_amount_bottom" => "ОБЩА СТОЙНОСТ",
    "my_address"          => '
                УИКРАФТ МЕДИЯ ООД<br/>
                бул. "Русе"87, вх. Е, ет.4, ап.8<br/>
                5800 Плевен, България<br/>
                :name<br/>
                (accounts@wecraftmedia.com)<br/>
                ЕИК: BG202346259
            ',
    'bank_recipient'      => 'Получател: УИКРАФТ МЕДИЯ ООД',
];